========================================
  FRIDGE PHASE 2.5: KEEP-ALIVE MODE
========================================

âš ï¸  ACTIVE MODE: Connection + Keep-Alive
   - Will connect to fridge (with retries)
   - Will enable notifications
   - Will send keep-alive every 2 seconds
   - Will NOT send temperature commands

Current Phase: 3 (KEEPALIVE)
Target MAC: ff:ff:11:c6:29:50
Connection retries: 5 max
Keep-alive interval: 2000 ms
Min operation delay: 5000 ms
Reconnect delay: 300 seconds

Initializing BLE...
âœ“ BLE initialized


[STATE] Ready to scan for fridge
========================================
Starting scan for fridge...
========================================


[STATE] Scanning for fridge...

[SCAN] Looking for fridge (MAC: ff:ff:11:c6:29:50)...
[SCAN] Duration: 10 seconds


ğŸº FRIDGE FOUND!
   MAC: ff:ff:11:c6:29:50
   RSSI: -93 dBm
âœ“ Fridge found!
[DELAY] Waiting 5000 ms - Post-scan stabilization

[STATE] Attempting connection to fridge...

â•”â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•—
â•‘  PHASE 2.5: CONNECTION + KEEP-ALIVE   â•‘
â•šâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

âš ï¸  SAFETY: Keep-alive only
   - Will enable notifications
   - Will send keep-alive every 2 seconds
   - Will NOT send temperature commands
   - Just maintain connection

[Step 1] Creating BLE client...
âœ“ Client created
[DELAY] Waiting 5000 ms - Post client creation

[Step 2] Connecting to fridge...
   Target: ff:ff:11:c6:29:50
   Will retry up to 5 times

   Attempt 1/5...

âœ“ BLE Client connected!
   âœ“ Connected!

âœ“ Connected successfully on attempt 1
[DELAY] Waiting 1000 ms - Post connection stabilization (reduced)

[Step 3] Discovering services...

[STATE] Discovering BLE services
âœ“ Service found
   UUID: 00001234-0000-1000-8000-00805f9b34fb
[DELAY] Waiting 500 ms - Post service discovery (reduced)

[Step 4] Getting characteristics...

[STATE] Getting characteristics

ğŸ” DIAGNOSTIC: Enumerating ALL characteristics:
[ 19313][E][BLERemoteCharacteristic.cpp:287] retrieveDescriptors(): esp_ble_gattc_get_all_descr: Unknown
[ 19331][E][BLERemoteCharacteristic.cpp:287] retrieveDescriptors(): esp_ble_gattc_get_all_descr: Unknown
   Handle: 0x0006, UUID: 00001235-0000-1000-8000-00805f9b34fb
   Handle: 0x0003, UUID: 00001236-0000-1000-8000-00805f9b34fb
   Handle: 0x0008, UUID: 0000fff1-0000-1000-8000-00805f9b34fb
ğŸ” END DIAGNOSTIC

âœ“ Notify characteristic found
   UUID: 00001236-0000-1000-8000-00805f9b34fb
   Handle: 0x0003
âœ“ Write characteristic found
   UUID: 00001235-0000-1000-8000-00805f9b34fb
   Handle: 0x0006 âš ï¸  CHECK IF THIS IS 0x0006!
[DELAY] Waiting 500 ms - Post characteristic discovery (reduced)

[Step 5] Enabling notifications...

[STATE] Enabling notifications
âš ï¸  IMPORTANT: Enabling notifications ONLY
   - Using manual CCCD write (like nRF Connect)
   - Not sending any data
   - Not sending keep-alive
   - Just listening

[5a] Registering callback function...
âœ“ Callback registered (notifications not enabled yet)
[DELAY] Waiting 500 ms - Post callback registration (reduced)

[5b] Manually enabling notifications via CCCD write...
   Finding CCCD descriptor (0x2902)...
âœ“ CCCD descriptor found
[DELAY] Waiting 500 ms - Pre-CCCD write (reduced)
   Writing 0x01 0x00 to CCCD...
âœ“ CCCD write complete - Notifications enabled!
[DELAY] Waiting 1000 ms - Post notification enable (reduced)

[Step 6] Starting keep-alive loop...
âš ï¸  CRITICAL: Keep-alive is REQUIRED
   - Sending FE FE 03 01 02 00 every 2 seconds
   - Fridge will disconnect without it
   - This prevents GATT CONN TIMEOUT

[DELAY] Waiting 1000 ms - Before first keep-alive (reduced)
   Sending FIRST keep-alive...
   Data: FE FE 03 01 02 00
   âœ“ First keep-alive sent!


========================================
ğŸ“¨ NOTIFICATION #1 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #2 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================


[Step 7] Connection complete!

[STATE] Connected - Keep-alive active

â•”â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•—
â•‘  CONNECTION SUCCESSFUL!                â•‘
â•šâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

Connection time: 11774 ms
Connection attempts: 1
Connection retries: 0

ğŸ“ NOW RUNNING:
   - Keep-alive every 2 seconds (automatic)
   - Monitoring notifications from fridge
   - Connection should stay stable
   - Watch for responses to keep-alive

[Keep-Alive #2] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #3 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #4 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #3] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #5 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #6 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78 


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #4] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #7 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD 
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #8 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #5] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #9 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #10 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #6] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #11 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #12 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #7] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #13 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #14 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #8] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #15 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #16 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #9] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #17 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #18 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #10] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #19 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #20 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78 


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #11] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #21 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #22 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #12] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #23 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64 

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #24 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78 


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #13] Sending... 
========================================
ğŸ“¨ NOTIFICATION #25 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================

âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #26 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

[Keep-Alive #14] Sending... âœ“ Sent

========================================
ğŸ“¨ NOTIFICATION #27 RECEIVED!
========================================
Length: 20 bytes
Data: FE FE 21 01 00 01 00 02 03 14 EC 02 00 00 FD FD
      FD 00 05 64

âœ“ Valid frame detected (FE FE 21)
  Type: Status frame

  ğŸ“Š DECODING STATUS FRAME:
     Zone/Side: 0x01 (Left compartment)
     Status bytes: 0x00 0x01
     Setpoint area: 0x00 0x02 (Possible: 2Â°C)
     Temp area 1: 0x03 0x14 (Possible: 20Â°C)
     Temp area 2: 0xEC 0x02 (Combined: -5118, or separate: -20 / 2)
     Middle bytes: 0x00 0x00 0xFD
     FD markers: 0xFD 0xFD 0x00
     Final bytes: 0x05 0x64 (0x64 = 100 decimal - battery %?)

  ğŸ’¡ INTERPRETATION HINTS:
     - Change temp setpoint and observe which bytes change
     - Switch AC/DC power and look for bit flips
     - Enable/disable Eco mode and check status bytes
     - Let compressor run and see what updates

  âœ“ Values stored in fridgeData structure
========================================


========================================
ğŸ“¨ NOTIFICATION #28 RECEIVED!
========================================
Length: 16 bytes
Data: 0C 09 F1 00 00 02 FD FD FD 00 F2 01 00 00 0B 78


âš ï¸  Unknown frame format (not FE FE ...)
========================================

